Tekla Open API Reference for Tekla Structures 2025
Events Methods
The Events type exposes the following members.
Methods
Name | Description
Dispose
 Disposes of the Events instance.
InitializeLifetimeService
 Initializes the lifetime service.
 (Overrides MarshalByRefObject.InitializeLifetimeService().)
OnInterrupted
 Called when uesr interrupts.
Register
 Registers the instance to listen to the specified events.
UnRegister
 Unregisters the instance from listening to events.
Top
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace